/****************************************************
* 文 件 名：
* 描    述：指示灯应用
* 作    者：wilson
* 编写时间：20xx.xx.xx
* 修改记录：
  |条目  |修改人     |日期       |修改内容
  1、    youdream    20xx.xx.xx  a)第一版
* 备    忘：
  1、无
*****************************************************/

#include "Led.h"

/**********************变量定义**********************/
// ---------------------------------------------------

/**********************函数声明**********************/
// ---------------------------------------------------
void LedInit(void);
static void LedGpioConfig(void);

/**********************函数定义**********************/
// ---------------------------------------------------
// -----------------------------------------------------------------------------
/****************************************************
* 函数名称 ：
* 功    能 ：Led应用初始化
* 入口参数 ：无
* 返回参数 ：无
* 注意事项 ：
*****************************************************/
void LedInit(void)
{
	LedGpioConfig();
}

/****************************************************
* 函数名称 ：
* 功    能 ：LED控制端口配置
* 入口参数 ：无
* 返回参数 ：无
* 注意事项 ：
*****************************************************/
static void LedGpioConfig(void)
{
	GPIO_InitTypeDef   GPIO_InitStructure;					// 定义一个GPIO_InitTypeDef类型的结构体
	
	/* LED控制端口配置 ---------------------------- */		
	RCC_APB2PeriphClockCmd(LED1_GPIO_CLK, ENABLE);			// 开启对应外设的时钟
	
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;		// 设置引脚的输出速率，50MHz
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;		// 设置引脚的操作模式，普通输出

	GPIO_InitStructure.GPIO_Pin = LED1_PIN;					// 选择要控制的GPIO引脚
	GPIO_Init(LED1_GPIO_PORT, &GPIO_InitStructure);			// 初始化对应GPIO
}

/*********************End of File********************/
